Catalogs/МЙ_ВидыУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МЙ_ВидыУпаковки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВетис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МЙ_ВидыУпаковки/Ext/ManagerModule.bsl
Процедура ОбновитьИзМакета() Экспорт
	
	Макет = ПолучитьМакет("PackingForm");
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		GUID = СокрЛП(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		UUID = СокрЛП(Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		Наименование = СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		КодВетис = СокрЛП(Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		
		ВидУпаковки = Справочники.МЙ_ВидыУпаковки.НайтиПоКоду(GUID);
		
		Если НЕ ЗначениеЗаполнено(ВидУпаковки) Тогда
			ВидУпаковки = Справочники.МЙ_ВидыУпаковки.СоздатьЭлемент();
			ВидУпаковки.Код = GUID;			
		Иначе
			ВидУпаковки = ВидУпаковки.ПолучитьОбъект();
		КонецЕсли; 
		
		ВидУпаковки.UUID = UUID;
		ВидУпаковки.Наименование = Наименование;
		ВидУпаковки.КодВетис = КодВетис;
		
		Попытка 
			ВидУпаковки.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры
